app/controllers/books_controller.rb

  def create
   @book = Book.new(book_params)
   @book.user_id = current_user.id
   if @book.save
   flash[:success] = "successfully"
      redirect_to @book
    else
   flash[:danger] = @book.errors.full_messages
      @books = Book.all
---
INSERT INTO "books" ("title", "opinion", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["opinion", "a"], ["user_id", 2], ["created_at", "2018-12-14 16:40:13.108233"], ["updated_at", "2018-12-14 16:40:13.108233"]]
SELECT "books".* FROM "books"

  def index
    @books = Book.all
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def update
    @book = Book.find(params[:id])
    @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "books" SET "opinion" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["opinion", "aaaaaa"], ["updated_at", "2018-12-16 11:23:08.140961"], ["id", 1]]