app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Shuichi"], ["image_id", nil], ["introduction", "aa"], ["updated_at", "2018-12-18 06:01:07.376406"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
     if @user.update(user_params)